#+TITLE: DM1 Week 07 Prepare and Teach
#+LANGUAGE: en
#+OPTIONS: H:4 num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t
#+OPTIONS: html-postamble:nil
#+STARTUP: showeverything entitiespretty
#+SETUPFILE: ../theme-bigblow.setup
#+BEGIN: clocktable :maxlevel 2 :scope file
#+CAPTION: Clock summary at [2018-03-01 Thu 23:02]
| Headline                                    |   Time |      |
|---------------------------------------------+--------+------|
| *Total time*                                | *1:25* |      |
|---------------------------------------------+--------+------|
| Prepare                                     |   0:25 |      |
| \_  Answer What is True By Way of Review... |        | 0:06 |
| \_  Read About Creativity                   |        | 0:08 |
| \_  Answer What is True                     |        | 0:11 |
| Teach                                       |   1:00 |      |
#+END:

* Instructions
  See [[file:../week00/00-ponder--prove.org]]

* Important!! README Important!!
  Just to be clear:

  The first part, *Prepare*, is due at midnight (00:00 --- that's zero one
  hundred hours, in military-speak, otherwise known as 12:00 A.M., the first
  moment of the day) on Thursday, March 1st, 2018. That means added (or staged,
  in magit-speak), committed, and pushed.

* Prepare
** DONE Answer What is True By Way of Review (and Preview)
   CLOSED: [2018-02-26 Mon 18:22]
   :LOGBOOK:
   CLOCK: [2018-02-26 Mon 18:16]--[2018-02-26 Mon 18:22] =>  0:06
   :END:
   You know what to do.
  - [X] I know that a prime is an integer greater than 1 that is divisible only
    by 1 and itself.
  - [X] I know that a prime is an integer greater than 1 that has exactly two
    factors.
  - [X] I know that a composite is an integer greater than 1 that has three or
    more factors.
  - [X] I know that the number 1 is the loneliest number --- it is neither prime
    nor composite.
  - [X] I know that every integer greater than 1 can be written uniquely as a
    prime or as the product of two or more primes where the prime factors are
    written in order of nondecreasing size.
  - [X] I know what the theorem mentioned in the previous assertion is called.
  - [X] I know why it is that if n is a composite integer, then n has a prime
    divisor less than or equal to \radic{}n.
  - [X] I know why it is *false* to say that the product of any two primes is
    odd.
  - [X] I know how big or how to find out how big the largest known prime is
    (big as in how many decimal digits it has).
  - [X] I know how ENT meets up with the methods of continuous mathematics
    (e.g., calculus) in the statement of the PNT.
  - [X] I know what the TLAs ENT and PNT expand to.
  - [X] I know how to compute the GCD and the LCM of two numbers.
  - [X] I know what the TLAs GCD and LCM expand to.
  - [X] I know how to create an efficient =is-prime= predicate (at least up to
    the prime 179424673) given the [[elisp:(load-file%20"first-ten-million-primes.el")][first-ten-million-primes]] vector.
  - [X] I am ready to learn how the RSA cryptosystem works.
  - [X] I am ready to learn why the RSA cryptosystem works.

** DONE Read About Creativity
   CLOSED: [2018-02-27 Tue 12:34]
   :LOGBOOK:
   CLOCK: [2018-02-27 Tue 12:26]--[2018-02-27 Tue 12:34] =>  0:08
   :END:
  [[https://firstthreeodds.org/17657741833134731255/creativity.html][This excerpt]] from Steve Olson\rsquo{}s book that you first encountered (a different
  excerpt from) in [[file:../week05/05-prepare-teach.org][Week 05]] has some bearing on your last week\rsquo{}s *Teach*
  activity. What is the connection?

#+BEGIN_info
Both the problem in the excerpt and in the *Teach* from last week required
mathematical creativity, and there were different ways to solve the problems.
#+END_info

** DONE Answer What is True
   CLOSED: [2018-02-27 Tue 12:45]
   :LOGBOOK:
   CLOCK: [2018-02-27 Tue 12:34]--[2018-02-27 Tue 12:45] =>  0:11
   :END:
   You know what to do.
  - [X] I discovered that the formidable-looking problem that opened the second
    day of the 42^{nd} International Mathematical Olympiad is the same problem as
    the one in FDK, which was part of the ponder--prove of last week, and was
    optional.
  - [X] I found (or am finding) creative problem solving to be harder than I
    thought.
  - [X] I discovered that a way to think about creativity is to compare it to
    biological evolution.
  - [X] I thought about how \ldquo{}[my] mind takes apart old ideas and observations and
    juxtaposes their elements in new ways.\rdquo
  - [X] I know what word goes in the blank: \ldquo{}What keeps a lot of people from
    being creative is that they are too _________. \rdquo
    - impatient
  - [X] I know what my personal selection process looks like, as in: \ldquo{}With so
    many ways of combining things, creators cannot consider every possibility.
    They must go through a selection process by which they first consider the
    most promising options.\rdquo

* Teach
  :LOGBOOK:
  CLOCK: [2018-03-01 Thu 12:45]--[2018-03-01 Thu 13:45] =>  1:00
  :END:
  Discuss and write a short MI-free sentence (or more if you feel the need)
  describing what the connection is between what Steve Olson wrote about
  creativity and your last week\rsquo{}s *Teach* activity.

#+begin_info
Both the problem in the excerpt and in the *Teach* from last week required
mathematical creativity, and there were different ways to solve the problems.
#+END_info
